In [9]:
import numpy as np
from scipy import stats
import pandas as pd
import matplotlib.pyplot as plt
from scipy.stats import skew
import scipy.stats as st
import seaborn as sns

ANÁLISIS FORMAL DE NUESTRO DATASET, UNIVERSIDADES EN UK

En UK conviven 131 Universidades.

In [3]:
df = pd.read_csv("./Estadística/uk_universities.csv")

In [4]:
# hacemos un analisis de base, con nuestros metodos favoritos

df.shape

(131, 21)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 131 entries, 0 to 130
Data columns (total 21 columns):
 #   Column                                         Non-Null Count  Dtype
---  ------                                         --------------  -----
 0   University_name                                131 non-null    object
 1   Region                                         131 non-null    object
 2   Founded_year                                   131 non-null    int64
 3   Motto                                          114 non-null    object
 4   UK_rank                                        131 non-null    int64
 5   World_rank                                     131 non-null    int64
 6   CWUR_score                                     84 non-null     float64
 7   Minimum_IELTS_score                            131 non-null    float64
 8   UG_average_fees_(in_pounds)                    131 non-null    int64
 9   PG_average_fees_(in_pounds)                    131 non-null    int64
 10  International_students                         131 non-null    object
 11  Student_satisfaction                           131 non-null    object
 12  Student_enrollment                             131 non-null    object
 13  Academic_staff                                 131 non-null    object
 14  Control_type                                   131 non-null    object
 15  Academic_Calender                              105 non-null    object
 16  Campus_setting                                 113 non-null    object
 17  Estimated_cost_of_living_per_year_(in_pounds)  131 non-null    int64
 18  Latitude                                       131 non-null    float64
 19  Longitude                                      131 non-null    float64
 20  Website                                        131 non-null    object
dtypes: float64(4), int64(6), object(11)
memory usage: 21.6+ KB

In [6]:
df.describe(include = "all")

,University_name,Region,Founded_year,Motto,UK_rank,World_rank,CWUR_score,Minimum_IELTS_score,UG_average_fees_(in_pounds),PG_average_fees_(in_pounds),...,Student_satisfaction,Student_enrollment,Academic_staff,Control_type,Academic_Calender,Campus_setting,Estimated_cost_of_living_per_year_(in_pounds),Latitude,Longitude,Website
count,131,131,131.000000,114,131.000000,131.00000,84.000000,131.000000,131.000000,131.000000,...,131,131,131,131,105,113,131.000000,131.000000,131.000000,131
unique,131,12,NaN,113,NaN,NaN,NaN,NaN,NaN,NaN,...,82,16,18,2,5,3,NaN,NaN,NaN,131
top,University of Cambridge,London,NaN,To know the causes of things,NaN,NaN,NaN,NaN,NaN,NaN,...,79.00%,"15,000-19,999","1,000-1,499",Public,Semesters,Urban,NaN,NaN,NaN,www.cam.ac.uk
freq,1,22,NaN,2,NaN,NaN,NaN,NaN,NaN,NaN,...,5,29,27,126,75,68,NaN,NaN,NaN,1
mean,NaN,NaN,1925.221374,NaN,65.900763,1097.59542,73.960714,4.946565,12537.450382,13099.763359,...,NaN,NaN,NaN,NaN,NaN,NaN,8644.732824,52.749708,-1.673287,NaN
std,NaN,NaN,139.040187,NaN,37.922158,1145.00106,6.351473,0.617850,2555.318861,3106.398149,...,NaN,NaN,NaN,NaN,NaN,NaN,1579.049538,1.638257,1.503049,NaN
min,NaN,NaN,1096.000000,NaN,1.000000,2.00000,65.900000,4.000000,8350.000000,6000.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,5500.000000,50.171300,-6.675200,NaN
25%,NaN,NaN,1896.000000,NaN,33.500000,196.00000,68.675000,4.500000,10758.000000,11250.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,7710.500000,51.499700,-2.748000,NaN
50%,NaN,NaN,1966.000000,NaN,65.000000,691.00000,72.600000,4.500000,12000.000000,12500.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,8217.000000,52.407400,-1.551600,NaN
75%,NaN,NaN,1992.000000,NaN,98.000000,1569.00000,77.700000,5.500000,13825.000000,14182.500000,...,NaN,NaN,NaN,NaN,NaN,NaN,9457.500000,53.608500,-0.388150,NaN
max,NaN,NaN,2013.000000,NaN,131.000000,5253.00000,94.100000,6.500000,23500.000000,29900.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,15000.000000,57.164800,1.296700,NaN

In [8]:
df.sample(5)

,University_name,Region,Founded_year,Motto,UK_rank,World_rank,CWUR_score,Minimum_IELTS_score,UG_average_fees_(in_pounds),PG_average_fees_(in_pounds),...,Student_satisfaction,Student_enrollment,Academic_staff,Control_type,Academic_Calender,Campus_setting,Estimated_cost_of_living_per_year_(in_pounds),Latitude,Longitude,Website
18,"Royal Holloway, University of London",South East England,1849,"To be, rather than to seem",19,129,73.8,5.5,13200,13900,...,80.60%,"10,000-14,999","1,000-1,499",Public,Semesters,Suburban,7500,51.4257,-0.5631,www.rhul.ac.uk
19,University of Southampton,South East England,1952,The Heights Yield to Endeavour,20,110,80.9,5.5,14660,15160,...,78.60%,"20,000-24,999","2,500-2,999",Public,Semesters,Suburban,7200,50.9344,-1.3965,www.soton.ac.uk
110,University of Salford,North West England,1967,Let us seek higher things,111,680,67.7,4.5,11795,12000,...,76.80%,"20,000-24,999","1,000-1,499",Public,Semesters,Urban,7471,53.4872,-2.2737,www.salford.ac.uk
74,University of Central Lancashire,North West England,1992,From the Earth to the Sun,75,804,68.2,4.5,11450,11950,...,78.70%,"20,000-24,999","1,500-1,999",Public,Semesters,Urban,7500,53.7645,-2.7083,www.uclan.ac.uk
96,Glasgow Caledonian University,Scotland,1993,For the Common Weal,96,1284,67.2,4.5,10467,11133,...,76.50%,"15,000-19,999",700-799,Public,Trimesters,Urban,8000,55.8668,-4.2500,www.gcu.ac.uk

In [ ]:
# tenemos un df con los registros que son nulos en nuestra columna. NO NOS SIRVE, pero lo guardamos
df_nulos = df[ df["CWUR_score"].isna()]
df_nulos

In [41]:
# Borramos todos los registros del df que sean nulos en nuestra columna de score.
df_sin_nulos = df[df["CWUR_score"].notnull()]
df_sin_nulos.shape

(84, 21)

In [43]:
# La relación entre el ranking mundial y la puntuación mundial 

# haríamos una matriz correlacionada de las dos variables
# Nos da una correlación negativa, lo cual tiene sentido, pues a mayor puntuacion "menor" número en el ranking (una posición más alta)


matriz_corr = np.corrcoef(df_sin_nulos["World_rank"],df_sin_nulos["CWUR_score"])
matriz_corr

array([[ 1.        , -0.51235593],
       [-0.51235593,  1.        ]])

In [44]:
# Probamos la correlación con el ránking de UK y nos devuelve una mayor correlación negativa. 

matriz_corr2 = np.corrcoef(df_sin_nulos["UK_rank"],df_sin_nulos["CWUR_score"])
matriz_corr2

array([[ 1.        , -0.74996008],
       [-0.74996008,  1.        ]])

In [54]:
df_sin_nulos.head()

,University_name,Region,Founded_year,Motto,UK_rank,World_rank,CWUR_score,Minimum_IELTS_score,UG_average_fees_(in_pounds),PG_average_fees_(in_pounds),...,Student_satisfaction,Student_enrollment,Academic_staff,Control_type,Academic_Calender,Campus_setting,Estimated_cost_of_living_per_year_(in_pounds),Latitude,Longitude,Website
0,University of Cambridge,East of England,1209,"From here, light and sacred draughts",1,4,94.1,6.5,21750,23187,...,85.50%,"20,000-24,999","over-5,000",Public,Trimesters,Urban,12000,52.2054,0.1132,www.cam.ac.uk
1,University of Oxford,South East England,1096,The Lord is my light,2,2,93.3,6.5,21770,19888,...,86.50%,"25,000-29,999","over-5,000",Public,Trimesters,Urban,11500,51.7548,-1.2544,www.ox.ac.uk
2,University of St Andrews,Scotland,1413,Ever to excel,3,86,75.8,6.5,17040,15440,...,87.90%,"10,000-14,999","1,000-1,499",Public,Semesters,Suburban,12000,56.3417,-2.7943,www.st-andrews.ac.uk
3,Imperial College London,London,1907,Knowledge is the adornment and safeguard of th...,4,8,86.6,6.5,23500,29900,...,77.90%,"15,000-19,999","4,000-4,499",Public,Continuous,Urban,10700,51.4988,-0.1749,www.ic.ac.uk
4,Loughborough University,East Midlands,1966,"With Truth, Knowledge and Labour",5,404,72.8,5.5,16400,16400,...,85.80%,"15,000-19,999","1,500-1,999",Public,Semesters,Suburban,9398,52.7650,-1.2321,www.lboro.ac.uk/

In [59]:
rank_uk = df_sin_nulos[["UK_rank","CWUR_score"]]
rank_uk

     UK_rank  CWUR_score
0          1        94.1
1          2        93.3
2          3        75.8
3          4        86.6
4          5        72.8
..       ...         ...
118      119        66.9
119      120        68.1
121      122        71.1
122      123        66.1
123      124        66.0

[84 rows x 2 columns]